<template>
    <div class="policy">
      <p class="red">(本活動限註冊會員後方可參加)</p>
            <h2>閱讀條款</h2>
            <p class="red">※ 須將卷軸拉至底部完成閱讀，才能勾選同意，進行下一步｡</p>
            <div class="policyFrame">
                <div id="policyDiv1">
                  <div class="policyCon">
                    <h2>網路投保聲明事項</h2>

                    <h3>【要保人與被保險人聲明事項】</h3>
                    <p>一、本人（被保險人）同意[新安東京海上產物保險(股)公司]得蒐集、處理及利用本人相關之健康檢查、醫療及病歷個人資料。</p>
                    <p>二、本人（被保險人、要保人）同意[新安東京海上產物保險(股)公司]將線上投保平台上所載本人資料轉送產、壽險公會建立電腦系統連線，並同意產、壽險公會之會員公司查詢本人在該系統之資料以作為核保及理賠之參考，但各該公司仍應依其本身之核保或理賠標準決定是否承保或理賠，不得僅以前開資料作為承保或理賠之依據。</p>
                    <p>三、本人（被保險人、要保人）已審閱並瞭解[新安東京海上產物保險(股)公司]所提供之「投保須知」，另依「新安東京海上產險履行個人資料保護法告知義務內容」，本人已瞭解貴公司蒐集、處理及利用本人個人資料之目的及用途。</p>
                    <p>四、本人（被保險人、要保人）知悉[新安東京海上產物保險(股)公司]得依「個人資料保護法」之相關規定，於特定目的範圍內對本人之個人資料，有蒐集、處理及利用之權利。</p>

                    <h3>【本公司聲明事項】</h3>
                    <p>一、本商品經本公司合格簽署人員檢視其內容業己符合保險精算原則及保險法令，惟為確保權益，基於保險業與消費者衡平對等原則，消費者仍應詳加閱讀保險單條款與相關文件，審慎選擇保險商品。本商品如有虛偽不實或違法情事，應由本公司及負責人依法負責。</p>
                    <p>二、投保後解約或不繼續繳費可能不利消費者，請慎選符合需求之保險商品。保險契約各項權利義務皆詳列於保單條款，消費者務必詳加閱讀了解。如需參考其他相關商品資訊，可查閱本公司網站或洽服務人員辦理。</p>
                    <p>三、本公司保留承保與否之權利。其他未盡詳細事項，得依保單條款辦理。</p>
                    <p>四、有關本公司保密措施詳細內容及資訊公開說明，歡迎利用網際網路至本公司網站 <a href="https://www.tmnewa.com.tw" target="_blank">https://www.tmnewa.com.tw</a> 查詢。免費客服及申訴電話：0800-050-119</p>

                    <h3>【重要提醒事項】</h3>
                    <p>一、本公司線上註冊及網路投保將以E-mail及手機簡訊通知投保完成，煩請務必留下正確聯絡方式。</p>
                    <p>二、【網路投保】完成首次註冊及身份驗證作業，須填寫足資驗證其身份之個人資料，配合本公司傳送一次性密碼(OTP)至要保人手機或電子信箱，以確認身份始得進行投保作業並同意網路保險服務定型化契約。需以要保人（同被保險人）本人之信用卡或銀行帳戶繳交保險費，完成身份驗證後可免簽回要保書。要保人完成網路投保後，本公司網路客服人員將依法令規定，於保單寄發前進行抽樣電話訪問確認投保意願，且要保人同意本公司進行全程錄音並備份存檔。</p>
                    <p>三、保單寄送作業：電子保單將於核保完成後1個工作天內將保單及收據寄送至您所填寫的電子信箱。</p>
                    <p>四、保戶於完成繳費後，經本公司確認投保完成，其保險效力即自動生效，保單因故未收悉，亦不影響契約效力。</p>

                    <p>版本日期110/11/15</p>

                  </div>
                </div>
                <div class="agreeDiv" id="agreeDiv1">
                    <input type="checkbox" id="isAgree1" name="isAgree1" value="true" class="agree-check">
                    <label for="isAgree1"><span></span>本人已閱讀並同意上述網路投保聲明事項</label>
                </div>
            </div>
            <div class="policyFrame">
                <div id="policyDiv2">
                  <div class="policyCon">
                    <h2>網路保險服務定型化契約</h2>

                    <h3>第一條	契約之適用範圍</h3>
                    <p>當事人間依電子簽章法及相關法令之規定從事保險電子交易者，適用本契約之約定。但個別網路保險服務契約對消費者之保護更有利者，從其約定。</p>
                    <h3>第二條	名詞定義</h3>
                    <p>本契約之名詞定義如下：</p>
                    <p>一、	「保險電子交易」：指消費者經由網際網路與本保險公司資訊系統電腦連線，且利用電子簽章或其他足資辨識消費者身分之方式，直接取得本保險公司所提供之各項保險服務。</p>
                    <p>二、	「電子訊息」：指本保險公司或消費者經由網際網路連線傳遞之訊息。</p>
                    <p>三、	「數位簽章」：指將電子文件以數學演算法或其他方式運算為一定長度之數位資料，以簽署人之私密金鑰對其加密，形成電子簽章，並得以公開金鑰加以驗證者。</p>
                    <p>四、	「私密金鑰」：指一組具有配對關係之數位資料中，由簽章製作者保有之數位資料，該數位資料係作電子訊息解密及製作數位簽章之用。</p>
                    <p>五、	「公開金鑰」：指一組具有配對關係之數位資料中，用以對電子訊息加密、或驗證簽署者身分及數位簽章真偽之數位資料。</p>
                    <p>六、	「加密」：指利用數學演算法或其他方法，將電子文件以亂碼方式處理。</p>
                    <p>七、	「電子簽章」：指依附於電子文件並與其相關連，用以辨識及確認電子文件簽署人身分、資格及電子文件真偽者。</p>
                    <p>八、	「憑證」：指載有簽章驗證資料，用以確認簽署人身分、資格之電子形式證明。</p>
                    <p>九、	「資訊系統」：指產生、送出、收受、儲存或其他處理電子形式訊息資料之系統。</p>
                    <h3>第三條	連線所使用之網路</h3>
                    <p>本保險公司及消費者應各自與網路業者簽訂網路服務契約，並各自負擔網路使用之費用。</p>
                    <h3>第四條	網頁之確認</h3>
                    <p>消費者與本保險公司交易前，應先確認本保險公司正確之網址。</p>
                    <p>本保險公司應盡善良管理人之注意義務，隨時維護網站的正確性與安全性，以避免消費者之權益受損。</p>
                    <h3>第五條	電子訊息之接收與回應</h3>
                    <p>本保險公司接收含數位簽章或經本保險公司及消費者同意用以辨識身分之電子訊息後，應立即以下列方式之一要求消費者再確認：</p>
                    <p>一、以資訊系統自動回覆通知消費者。</p>
                    <p>二、以資訊系統再次確認裝置提示消費者。</p>
                    <p>經消費者依前項規定再確認者，該項電子訊息視為已經本保險公司受理。</p>
                    <p>本保險公司受理消費者之電子訊息後，應即時進行檢核或處理，並於三日內將結果通知消費者。本保險公司應於同意承保後，將網路保險交易成功訊息（內容包含保險單號碼或交易序號、保險單生效時間、保險金額等重要資訊）傳送予消費者。本保險公司同意承保後，保險契約即為成立。本保險公司或消費者接收來自對方任何電子訊息，若無法辨識其身分或內容時，視為傳送作業未完成。但本保險公司可確定消費者身分時，應立即將內容無法辨識之事實通知消費者。</p>
                    <h3>第六條	電子訊息之不處理</h3>
                    <p>有下列情形之一者，本保險公司得不處理任何接收之電子訊息：</p>
                    <p>一、本保險公司能舉出證據有具體理由懷疑電子訊息之真實性或所指定事項之正確性者。</p>
                    <p>二、本保險公司依據電子訊息處理，將違反相關法令或保險契約之規定者。</p>
                    <p>本保險公司不處理前項電子訊息者，應同時將不處理之具體理由及情形通知消費者。</p>
                    <h3>第七條	消費者軟硬體安裝與風險</h3>
                    <p>消費者申請使用本契約之服務項目，應自費安裝其所需之電腦軟體、硬體，以及其他與安全相關之設備。消費者於使用本保險公司所交付之軟硬體設備時，如因可歸責於本保險公司之事由致受有損害，得向本保險公司請求賠償。</p>
                    <h3>第八條	消費者之注意義務</h3>
                    <p>消費者對使用者帳號、密碼、憑證及相關文件，應妥善保管。消費者輸入前項密碼連續錯誤達四次時，本保險公司資訊系統即自動停止消費者使用本契約之服務。消費者如擬恢復使用，應向本保險公司提出申請。</p>
                    <h3>第九條	交易核對</h3>
                    <p>本保險公司於每筆交易指示處理完畢後，以電子訊息或雙方約定之方式通知消費者，消費者應核對其結果有無錯誤。如有不符，應於通知到達之日起四十五日內，通知本保險公司查明。本保險公司對於消費者之通知，應即進行調查，並於通知到達本保險公司之日起四十五日內，將調查之情形或結果覆知消費者。</p>
                    <h3>第十條	電子訊息錯誤之處理</h3>
                    <p>消費者利用本契約之服務，如其電子訊息因不可歸責於消費者之事由而發生錯誤者，本保險公司應協助消費者更正，並提供其他必要之協助。前項服務因可歸責於本保險公司之事由而發生錯誤者，本保險公司應於知悉時，立即更正，並同時以電子訊息或雙方約定之方式通知消費者。</p>
                    <h3>第十一條	電子文件之合法授權與責任</h3>
                    <p>雙方應確保所傳送至對方之電子訊息均經合法授權。雙方於發現有第三人冒用或盜用使用者帳號、密碼、憑證或其他任何未經合法授權之情形，應立即以電話或書面或其他約定方式通知他方停止使用該服務並採取防範之措施。本保險公司接受通知前，已依前項服務之指示為給付者，得對抗消費者。但本保險公司有故意或過失者不在此限。</p>
                    <h3>第十二條	資料安全</h3>
                    <p>本保險公司對於所保有消費者及其利害關係人之個人資料檔案，應採取適當之安全措施，防止個人資料被竊取、竄改、毀損、滅失或洩露。</p>
                    <p>本保險公司違反前項規定，致個人資料遭不法蒐集、處理、利用或其他侵害當事人權利者，應負損害賠償責任。但能證明其無故意或過失者，不在此限。</p>
                    <h3>第十三條	資訊保密義務</h3>
                    <p>本保險公司因處理本契約及基於本契約所從事之保險電子交易，所取得之相關資料負有保密義務。除經當事人同意或符合個人資料保護之相關法令規定外，本保險公司不得使用於與本契約無關之目的或對第三人揭露。</p>
                    <h3>第十四條	損害賠償責任</h3>
                    <p>因本契約雙方之故意或過失，就本契約傳送或接收電子訊息，有遲延、遺漏或錯誤之情事；或就本契約所生義務之不履行或遲延履行，而致他方受有損害時，應負賠償責任。</p>
                    <h3>第十五條	紀錄保存</h3>
                    <p>雙方應保存所有保險電子交易訊息（不含查詢類）紀錄，並應確保其真實性及完整性。</p>
                    <p>本保險公司對前項紀錄之保存，應盡善良管理人之注意義務。保存期限至少為保險契約有效期限屆滿或通知消費者不同意承保後五年。</p>
                    <h3>第十六條	電子訊息之效力</h3>
                    <p>雙方同意依本契約利用電子簽章或電子文件方式交換之電子訊息，其效力與書面簽署或書面文件相同。</p>
                    <h3>第十七條	消費者終止契約</h3>
                    <p>消費者得隨時通知本保險公司終止本契約。</p>
                    <h3>第十八條	保險公司終止契約</h3>
                    <p>本保險公司欲終止本契約時，須於終止日三十日前以書面通知消費者。但消費者如有下列情事之一者，本保險公司得隨時以書面通知消費者終止本契約：</p>
                    <p>一、消費者未經本保險公司同意，擅自將本契約之權利或義務轉讓第三人。</p>
                    <p>二、消費者受法院破產或重整宣告。</p>
                    <p>三、消費者違反本契約第十二條第一項之規定。</p>
                    <p>四、消費者違反本契約之其他約定，經催告改善或限期請求履行未果。</p>
                    <h3>第十九條	通知處所</h3>
                    <p>消費者或本保險公司就本契約事項對他方為通知者，應向他方所留存本契約之最後地址或電子郵件信箱為之。</p>
                    <h3>第二十條	法令適用</h3>
                    <p>本契約準據法，依中華民國法律。</p>
                    <h3>第二十一條	管轄法院</h3>
                    <p>因本契約涉訟者，雙方同意以消費者住所地地方法院為第一審管轄法院。消費者之住所在中華民國境外時，以臺灣臺北地方法院為第一審管轄法院。但不得排除消費者保護法第四十七條及民事訴訟法第四百三十六條之九小額訴訟管轄法院之適用。</p>
                    <h3>第二十二條	契約修訂</h3>
                    <p>本契約如有未盡事宜，得經本保險公司及消費者協議補充或修正之。</p>
                    <p>版本日期110/05/05</p>
                  </div>
                </div>
                <div class="agreeDiv" id="agreeDiv2">
                    <input type="checkbox" id="isAgree2" name="isAgree2" value="true" class="agree-check">
                    <label for="isAgree2"><span></span>本人已閱讀並同意上述網路保險服務定型化契約</label>
                </div>
            </div>
            <div class="policyFrame single">
                <div id="policyDiv3">
                    <div class="policyCon">
                        <h2>個人資料告知事項</h2>

<h3>《個人資料保護法告知義務內容》</h3>
<p>本公司依據個人資料保護法（以下稱）第六條二項、 第八條一項 (如為間接蒐集之個人資料則為第九條一項 )規定，應告知下列事項，敬請 台端 詳閱及知悉：</p>
<p>一、蒐集目的：</p>
  <p>(一)財產保險(○九三)</p>
  <p>(二)人身保險(○○一)</p>
  <p>(三)其他經營合於業登記項目或組織章程所定之業務(一八一)</p>
<p>二、蒐集之個人資料類別： 包括但不限於姓名、身分證字號、出生年月日、住址、聯絡方式、婚姻、家庭、教育職業、財務情況、病歷、醫療、健康檢查、其他得以直接或 間接方式識別該個人之資料，詳如相關業務申請書或契約書內容。</p>
<p>三、個人資料之來源（非由當事提供間接蒐集情形適用）：</p>
  <p>(一)要保人/被保險人。</p>
  <p>(二)司法警憲機關、委託協助處理賠之公證人或機構。</p>
  <p>(三)當事人之法定代理人、輔助人。</p>
  <p>(四)各醫療院所。</p>
  <p>(五)與第三人共同行銷、交互運用客戶資料合作推廣等關係或於本公司各項業務內所委託往來之第三人。</p>
<p>四、利用之期間、地區對象及方式：</p>
  <p>(一)期間： 因執行業務所必須及依法令規定應為保存之期間。</p>
  <p>(二)對象： 本(分)公司及本海外分支機構、中華民國產物保險商業同業公會、中華民國人壽保險商業同業公會、財團法人保險事業發展中心、財團法人保 險安定基金、財團法人住宅地震保險基金、財團法人汽車交通事故特別補償基金、財團法人金融消費評議中心、財團法人金融聯合徵信中心、財 團法人聯合信用卡中心、台灣票據交換所、財金資訊公司、關貿網路股份有限公司、中央健康保險局、業務委外機構、與本公司合作推廣您保險契約之保險代理人公司或保險經紀人公司 (透過保險代理人公司或保險經紀人公司投保者)、與本公司有再保業務往來之公司、依法有調查權機關或金融監理機關。</p>
  <p>(三)地區： 上述對象所在之地區。</p>
  <p>(四)方式： 合於法令規定之利用方式。</p>
<p>五、依據個資法第三條規定，台端就本公司保有台端之個人資料得行使之權利及方式 ：</p>
<p>(一)得向本公司行使之權利：</p>
    <p>1.向本公司查詢、請求閱覽或請求製給複製本。</p>
    <p>2.向本公司請求補充或更正。</p>
    <p>3.向本公司請求停止蒐集、處理或利用及請求刪除。</p>
<p>(二)行使權利之方式： 以書面或其他日後可供證明之方式。</p>
<p>六、台端不提供個人資料所致權益之影響（個人資料由當事人直接蒐集情形適用之情形適用）：</p>
<p>台端若未能提供相關個人資料時，本公司將可延後或無法進行必要之審核及處理作業，因此可能婉謝承保、遲延或無法提供台端相關服務給付。</p>
<p>七、本公司網站對客戶個人資料的收集，遵守中華民國「個人資料保護法」之規範，為保障您的隱私及資料安全，您在本公司網站所提供的相關資料，會受到嚴密的保護。本公司不定時利用網頁的互動收集客戶的個人資料，一般情況下本公司會先取得客戶的同意，再進行個人資訊的收集。針對上述 本公司擁有的權利來使用、重製、展示、操作、修改、發送這些資料，但對於這些資料的利用，只限於為提供客戶符合其需求的保險計劃，或為本公司客戶及潛在客戶設計更好的保險商品，未經允許，我們絕不會將您的個人資料及交易資料，洩露至任何本公司以外的團體或其他第三者。</p>
<p>八、關於您提供的個人資料，我們將就資訊系統及公司作業規則制定嚴格規範，我們針對資料安全設備投注之保護措施如下：</p>
<p>(一)我們採用最佳的科技來保障您的個人資料安全。目前以Secure Sockets Layer(SSL) 機制(128bit)進行資料傳輸加密，並以加裝防火牆防止不法入侵，避免您的個人資料遭到非法存取。</p>
<p>(二)我們於2017年3月通過台灣檢驗科技(SGS)認證取得ISO27001資訊安全管理系統 (ISMS，Information Security Management System)標準，以確保您的資料在多層的資訊安全控管下，做到最高規 格的防護。 </p>
<p>【註】上開告知事項已公告於本公司官網（<a href="https://www.tmnewa.com.tw/" target="_blank">https://www.tmnewa.com.tw/</a>），如有任何問題，請洽詢0800-050-119免付費客服專線。版本日期110/03/18</p>
                    </div>
                </div>
                <div class="agreeDiv" id="agreeDiv3">
                    <input type="checkbox" id="isAgree3" name="isAgree3" value="true" class="agree-check">
                    <label for="isAgree3"><span></span>本人已閱讀並同意上述個人資料告知事項</label>
                </div>
            </div>
    </div>

</template>
<script>
export default {
  name: "policy",
  mounted(){
    this.check();
  },
  methods:{
      check(){
        $(".agree-check").addClass("disable");
        $("#isAgree1").attr("disabled", true);
        $("#isAgree2").attr("disabled", true);
        $("#isAgree3").attr("disabled", true);

        this.scroll($("#policyDiv1"),$("#isAgree1"));
        this.scroll($("#policyDiv2"),$("#isAgree2"));
        this.scroll($("#policyDiv3"),$("#isAgree3"));
      
      },
      scroll(Div,checkBox){
          Div.on('scroll', function () {
            var scrollHeight = ($(this).prop('scrollHeight') - $(this).height()) * 0.9;
            if ($(this).scrollTop() >= scrollHeight) {
                checkBox.attr("disabled", false).removeClass("disable");
            }
        });
      }
  }
  
};
</script>

<style lang="scss">
.policy{
    margin:10px auto;
    .red{color:#b90e0e;margin:10px 0;}
    .policyFrame{
        width:48%;
        display:inline-block;
        border: 1px solid #ccc;
        box-sizing: border-box;
        margin:0 1%;
        @media screen and (max-width: $small) {
            width:98%;
            margin:2% auto;
        }
        &.single{
            width:98%;
            margin:2% auto;
        }
        #policyDiv1,#policyDiv2,#policyDiv3{
             box-sizing: border-box;
            height:200px;
            overflow-y:scroll;
        }
        .policyCon{
            padding:10px;  
            text-align: left;
            font-size:14px;
            line-height:20px;
            h2{font-size:18px;margin:5px 0;} 
            h3{font-size:16px;margin:2px 0;}
            a{color:$pink}
        }
        .agreeDiv{
            margin:10px auto 0;
            background:#ddd;
            padding:10px 0;
            color:#083230;

            span{display:inline-block;}
            label{
            transform: scale(1);
            display: inline-block;
            transition: all 200ms ease-in-out;
             @media screen and (max-width: $pad) {
                display: inline-block;
                width: 85%;
                text-align: left;
                vertical-align:top;
             }
            }
            .disable+label{
            opacity:0.3;
            transition: all 200ms linear;
            transform: scale(0.9);
           }
          
        }
        
    }
}
</style>